# 声明一个值是你年龄的整型变量
# 声明一个值是你身高的浮点型变量
# 声明一个值是复数变量

# 编写一个脚本，提示用户输入三角形的底和高，并计算这个三角形的面积（面积 = 0.5 x b x h）。
#     输入底: 20
#     输入高: 10
#     三角形的面积是 100
#b = int(input("请输入三角形的底边:"))
# h = int(input("请输入三角形的高边:"))
# arer = 0.5 * b * h
# print(arer)

# 编写一个脚本，提示用户输入三角形的边 a、边 b 和边 c。计算三角形的周长（周长 = a + b + c）。
#     输入边 a: 5
#     输入边 b: 4
#     输入边 c: 3
#     三角形的周长是 12
# 提示用户输入矩形的长度和宽度。计算其面积（面积 = 长 x 宽）和周长（周长 = 2 x (长 + 宽)）
# b = int(input("请输入矩形的长:"))
# h = int(input("请输入矩形的宽:"))
# z = 2 *( b + h )
# print(z)

# 提示用户输入圆的半径。计算面积（面积 = pi x r x r）和周长（周长 = 2 x pi x r），其中 pi = 3.14。
# 计算 y = 2x -2 的斜率、x 截距和 y 截距

# 斜率是 (m = y2-y1/x2-x1)。找到点 (2, 2) 和点 (6,10) 之间的斜率和欧几里得距离。
# 比较练习 8 和练习 9 中的斜率。
# 计算 y 的值（y = x^2 + 6x + 9）。尝试使用不同的 x 值，并找出 y 何时为 0。
# 求出 'python' 和 'dragon' 的长度，并进行一个假的比较语句。
# 使用 and 运算符检查 'python' 和 'dragon' 中是否都有 'on'。
# I hope this course is not full of jargon。使用 in 运算符检查句子中是否有 jargon。
# 'dragon' 和 'python' 中都没有 'on'。
# 找到文本 python 的长度，并将该值转换为浮点数，然后将其转换为字符串。
# 偶数可以被 2 整除，余数为零。如何使用 Python 检查一个数字是偶数还是奇数？
# 检查 7 除以 3 的Floor除法是否等于 2.7 的整数转换值。
# 检查 '10' 的类型是否等于 10 的类型。
# 检查 int('9.8') 是否等于 10。

# 编写一个脚本，提示用户输入工时和时薪。计算用户的工资。
# 输入工时: 40
# 输入时薪: 28
# 你每周的薪资是 1120

# 编写一个脚本，提示用户输入年数。计算一个人可以活多少秒。假设一个人可以活一百年
# 输入你已经活了多少年: 100
# 你已经活了 3153600000 秒.
# 编写一个 Python 脚本，显示以下表格